export const faq = [
    {
        ques: "🍕 В яких містах працює доставка піци LA П'ЄЦ?",
        answer: "Ми працюємо у Львові, Вінниці, Івано-Франківську, Харкові, Стрию, Хмельницькому, Рівному, Чернівцях, Черкасах та Дрогобичі .",
        open: false
    },
    {
        ques: "🍕 В яких містах працює доставка піци LA П'ЄЦ?",
        answer: "Ми працюємо у Львові, Вінниці, Івано-Франківську, Харкові, Стрию, Хмельницькому, Рівному, Чернівцях, Черкасах та Дрогобичі .",
        open: false
    },

    {
        ques: "🍕 В яких містах працює доставка піци LA П'ЄЦ?",
        answer: "Ми працюємо у Львові, Вінниці, Івано-Франківську, Харкові, Стрию, Хмельницькому, Рівному, Чернівцях, Черкасах та Дрогобичі .",
        open: false
    },

    {
        ques: "🍕 В яких містах працює доставка піци LA П'ЄЦ?",
        answer: "Ми працюємо у Львові, Вінниці, Івано-Франківську, Харкові, Стрию, Хмельницькому, Рівному, Чернівцях, Черкасах та Дрогобичі .",
        open: false
    },


]